In [1]:
import sqlite3

In [2]:
con = sqlite3.connect("banco.db")

In [3]:
cur = con.cursor()

In [4]:
# res = cur.execute("SELECT name FROM sqlite_master")
# exists = any("movie" in record for record in res)

In [4]:
# if not exists:
#     cur.execute("CREATE TABLE movie(title, year, score)")
cur.execute("CREATE TABLE IF NOT EXISTS movie(title, year, score)")

In [5]:
res = cur.execute("SELECT name FROM sqlite_master")
#res.fetchone()
res.fetchall()

[('movie',)]

In [7]:
cur.execute("""INSERT INTO movie(title, year,score) VALUES ("Gladador", 2002, 9.9)""")

In [8]:
con.commit()

In [9]:
cur.execute("SELECT * FROM movie")
cur.fetchall()

[('Gladador', 2002, 9.9),
 ('Monty Python and the Holy Grail', 1975, 8.2),
 ('And Now for Something Completely Different', 1971, 7.5),
 ('Monty Python Live at the Hollywood Bowl', 1982, 7.9),
 ("Monty Python's The Meaning of Life", 1983, 7.5),
 ("Monty Python's Life of Brian", 1979, 8.0),
 ('Gladador', 2002, 9.9)]

In [10]:
cur.execute("""
    INSERT INTO movie VALUES
        ('Monty Python and the Holy Grail', 1975, 8.2),
        ('And Now for Something Completely Different', 1971, 7.5)
""")

con.commit()

In [11]:
result = cur.execute("SELECT * FROM movie")
result.fetchall()

[('Gladador', 2002, 9.9),
 ('Monty Python and the Holy Grail', 1975, 8.2),
 ('And Now for Something Completely Different', 1971, 7.5),
 ('Monty Python Live at the Hollywood Bowl', 1982, 7.9),
 ("Monty Python's The Meaning of Life", 1983, 7.5),
 ("Monty Python's Life of Brian", 1979, 8.0),
 ('Gladador', 2002, 9.9),
 ('Monty Python and the Holy Grail', 1975, 8.2),
 ('And Now for Something Completely Different', 1971, 7.5)]

In [12]:
data = [
    ("Monty Python Live at the Hollywood Bowl", 1982, 7.9),
    ("Monty Python's The Meaning of Life", 1983, 7.5),
    ("Monty Python's Life of Brian", 1979, 8.0),
]
cur.executemany("INSERT INTO movie VALUES(?, ?, ?)", data)
con.commit()

In [13]:
result = cur.execute("SELECT * FROM movie")
result.fetchall()

[('Gladador', 2002, 9.9),
 ('Monty Python and the Holy Grail', 1975, 8.2),
 ('And Now for Something Completely Different', 1971, 7.5),
 ('Monty Python Live at the Hollywood Bowl', 1982, 7.9),
 ("Monty Python's The Meaning of Life", 1983, 7.5),
 ("Monty Python's Life of Brian", 1979, 8.0),
 ('Gladador', 2002, 9.9),
 ('Monty Python and the Holy Grail', 1975, 8.2),
 ('And Now for Something Completely Different', 1971, 7.5),
 ('Monty Python Live at the Hollywood Bowl', 1982, 7.9),
 ("Monty Python's The Meaning of Life", 1983, 7.5),
 ("Monty Python's Life of Brian", 1979, 8.0)]

In [ ]:
target = 8.0
records = []
for res in cur.execute("SELECT * FROM movie"):
    if res[-1] > target:
        records.append(res)

In [15]:
res = cur.execute("SELECT * FROM movie WHERE score > 8")
res.fetchall()

[('Gladador', 2002, 9.9),
 ('Monty Python and the Holy Grail', 1975, 8.2),
 ('Gladador', 2002, 9.9),
 ('Monty Python and the Holy Grail', 1975, 8.2)]

In [6]:
cur.execute("UPDATE movie SET title = 'Gladiador' WHERE title = 'Gladador'")
res = cur.execute("SELECT * FROM movie WHERE score > 8")
res.fetchall()

[('Gladiador', 2002, 9.0),
 ('Monty Python and the Holy Grail', 1975, 8.2),
 ('Gladiador', 2002, 9.0),
 ('Monty Python and the Holy Grail', 1975, 8.2)]

In [7]:
con.commit()

In [8]:
con.close()

 Utilizando o pandas para trabalhar com o banco de dados

In [9]:
import pandas as pd

In [11]:
bd_carros = pd.read_csv("bd.csv")
bd_carros.head()

,Report Received Date,Manufacturer,Component,Recall Type,Potentially Affected
0,01/06/2023,Triple E Recreational Vehicles,ELECTRICAL SYSTEM,Vehicle,341.0
1,01/05/2023,"Volvo Car USA, LLC",STEERING,Vehicle,74.0
2,12/29/2022,"Volkswagen Group of America, Inc.",ELECTRICAL SYSTEM,Vehicle,1042.0
3,12/29/2022,Indian Motorcycle Company,STRUCTURE,Vehicle,4653.0
4,12/29/2022,Hendrickson USA. L.L.C.,"SERVICE BRAKES, AIR",Equipment,12.0

In [12]:
bd_carros.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26590 entries, 0 to 26589
Data columns (total 5 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Report Received Date  26590 non-null  object
 1   Manufacturer          26590 non-null  object
 2   Component             26590 non-null  object
 3   Recall Type           26590 non-null  object
 4   Potentially Affected  26548 non-null  float64
dtypes: float64(1), object(4)
memory usage: 1.0+ MB

In [ ]:
cur.execute
data = bd_carros.head().to_records(index=False).tolist()
cur.executemany(
    """
    INSERT INTO cars VALUES(?,?,?,?,?)
    """
)